In [1]:
import pandas as pd

In [2]:
# Open the text file
file_path = 'demographics.txt'

# Read the file into a DataFrame using pandas
demog = pd.read_csv(file_path, sep='\t')

# Perform data analysis
demog

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP
...,...,...,...,...,...,...,...,...,...
2235,10142,1976,PhD,Divorced,"$66,476.00",0,1,3/7/13,US
2236,5263,1977,2n Cycle,Married,"$31,056.00",1,0,1/22/13,SP
2237,22,1976,Graduation,Divorced,"$46,310.00",1,0,12/3/12,SP
2238,528,1978,Graduation,Married,"$65,819.00",0,0,11/29/12,IND
2239,4070,1969,PhD,Married,"$94,871.00",0,2,9/1/12,CA

In [3]:
demog.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2240 non-null   int64
 1   Year_Birth      2240 non-null   int64
 2   Education       2240 non-null   object
 3   Marital_Status  2240 non-null   object
 4    Income         2216 non-null   object
 5   Kidhome         2240 non-null   int64
 6   Teenhome        2240 non-null   int64
 7   Dt_Customer     2240 non-null   object
 8   Country         2240 non-null   object
dtypes: int64(4), object(5)
memory usage: 157.6+ KB

In [4]:
import json
import pandas as pd

# Load the JSON data from the file
with open('behaviour.json') as f:
    data = json.load(f)

# Initialize lists to store transformed data
ids = []
recency = []
mnt_wines = []
mnt_fruits = []
mnt_meat_products = []
mnt_fish_products = []
mnt_sweet_products = []
mnt_gold_prods = []
num_deals_purchases = []
num_web_purchases = []
num_catalog_purchases = []
num_store_purchases = []
num_web_visits_month = []

# Iterate over each item in the JSON data
for item in data:
    for key, value in item.items():
        # Extract ID
        ids.append(key)
        # Extract other attributes
        recency.append(value['Recency'])
        mnt_wines.append(value['MntWines'])
        mnt_fruits.append(value['MntFruits'])
        mnt_meat_products.append(value['MntMeatProducts'])
        mnt_fish_products.append(value['MntFishProducts'])
        mnt_sweet_products.append(value['MntSweetProducts'])
        mnt_gold_prods.append(value['MntGoldProds'])
        num_deals_purchases.append(value['NumDealsPurchases'])
        num_web_purchases.append(value['NumWebPurchases'])
        num_catalog_purchases.append(value['NumCatalogPurchases'])
        num_store_purchases.append(value['NumStorePurchases'])
        num_web_visits_month.append(value['NumWebVisitsMonth'])

# Create a DataFrame from the transformed data
behav = pd.DataFrame({
    'ID': ids,
    'Recency': recency,
    'MntWines': mnt_wines,
    'MntFruits': mnt_fruits,
    'MntMeatProducts': mnt_meat_products,
    'MntFishProducts': mnt_fish_products,
    'MntSweetProducts': mnt_sweet_products,
    'MntGoldProds': mnt_gold_prods,
    'NumDealsPurchases': num_deals_purchases,
    'NumWebPurchases': num_web_purchases,
    'NumCatalogPurchases': num_catalog_purchases,
    'NumStorePurchases': num_store_purchases,
    'NumWebVisitsMonth': num_web_visits_month
})

# Display the DataFrame
behav.head(10)

,ID,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,ID_1826,0,189,104,379,111,189,218,1,4,4,6,1
1,ID_1,0,464,5,64,7,0,37,1,7,3,7,5
2,ID_10476,0,134,11,59,15,2,30,1,3,2,5,2
3,ID_1386,0,10,0,1,0,0,0,1,1,0,2,7
4,ID_5371,0,6,16,24,11,0,34,2,3,1,2,7
5,ID_7348,0,336,130,411,240,32,43,1,4,7,5,2
6,ID_4073,0,769,80,252,15,34,65,1,10,10,7,6
7,ID_1991,0,78,0,11,0,0,7,1,2,1,3,5
8,ID_4047,0,384,0,102,21,32,5,3,6,2,9,4
9,ID_9477,0,384,0,102,21,32,5,3,6,2,9,4

In [5]:
behav['ID'] = behav['ID'].str.extract('(\d+)').astype(int)
behav.head()

,ID,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,1826,0,189,104,379,111,189,218,1,4,4,6,1
1,1,0,464,5,64,7,0,37,1,7,3,7,5
2,10476,0,134,11,59,15,2,30,1,3,2,5,2
3,1386,0,10,0,1,0,0,0,1,1,0,2,7
4,5371,0,6,16,24,11,0,34,2,3,1,2,7

In [6]:
behav.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int32
 1   Recency              2240 non-null   int64
 2   MntWines             2240 non-null   int64
 3   MntFruits            2240 non-null   int64
 4   MntMeatProducts      2240 non-null   int64
 5   MntFishProducts      2240 non-null   int64
 6   MntSweetProducts     2240 non-null   int64
 7   MntGoldProds         2240 non-null   int64
 8   NumDealsPurchases    2240 non-null   int64
 9   NumWebPurchases      2240 non-null   int64
 10  NumCatalogPurchases  2240 non-null   int64
 11  NumStorePurchases    2240 non-null   int64
 12  NumWebVisitsMonth    2240 non-null   int64
dtypes: int32(1), int64(12)
memory usage: 218.9 KB

In [7]:
# Load the JSON data from the file
with open('campaign.json') as f:
    data = json.load(f)

# Initialize lists to store transformed data
ids = []
accepted_cmp1 = []
accepted_cmp2 = []
accepted_cmp3 = []
accepted_cmp4 = []
accepted_cmp5 = []
response = []
complain = []

# Iterate over each item in the JSON data
for item in data:
    for key, value in item.items():
        # Extract ID
        ids.append(key)
        # Extract other attributes
        accepted_cmp1.append(value['AcceptedCmp1'])
        accepted_cmp2.append(value['AcceptedCmp2'])
        accepted_cmp3.append(value['AcceptedCmp3'])
        accepted_cmp4.append(value['AcceptedCmp4'])
        accepted_cmp5.append(value['AcceptedCmp5'])
        response.append(value['Response'])
        complain.append(value['Complain'])

# Create a DataFrame from the transformed data
campa = pd.DataFrame({
    'ID': ids,
    'AcceptedCmp1': accepted_cmp1,
    'AcceptedCmp2': accepted_cmp2,
    'AcceptedCmp3': accepted_cmp3,
    'AcceptedCmp4': accepted_cmp4,
    'AcceptedCmp5': accepted_cmp5,
    'Response': response,
    'Complain': complain
})
campa.head(10)

,ID,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,ID_1826,0,0,0,0,0,1,0
1,ID_1,0,1,0,0,0,1,0
2,ID_10476,0,0,0,0,0,0,0
3,ID_1386,0,0,0,0,0,0,0
4,ID_5371,0,0,1,0,0,1,0
5,ID_7348,0,0,0,0,0,1,0
6,ID_4073,0,0,1,0,0,1,0
7,ID_1991,0,0,0,0,0,0,0
8,ID_4047,0,0,0,0,0,0,0
9,ID_9477,0,0,0,0,0,0,0

In [8]:
campa['ID'] = campa['ID'].str.extract('(\d+)').astype(int)
campa.head()

,ID,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,0,0,0,0,0,1,0
1,1,0,1,0,0,0,1,0
2,10476,0,0,0,0,0,0,0
3,1386,0,0,0,0,0,0,0
4,5371,0,0,1,0,0,1,0

In [9]:
campa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            2240 non-null   int32
 1   AcceptedCmp1  2240 non-null   int64
 2   AcceptedCmp2  2240 non-null   int64
 3   AcceptedCmp3  2240 non-null   int64
 4   AcceptedCmp4  2240 non-null   int64
 5   AcceptedCmp5  2240 non-null   int64
 6   Response      2240 non-null   int64
 7   Complain      2240 non-null   int64
dtypes: int32(1), int64(7)
memory usage: 131.4 KB

In [10]:
merged_df = pd.merge(demog, behav, on='ID', how='outer').merge(campa, on='ID', how='outer')

In [11]:
merged_df.head(10)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country,Recency,...,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP,0,...,4,6,1,0,0,0,0,0,1,0
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA,0,...,3,7,5,0,1,0,0,0,1,0
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US,0,...,2,5,2,0,0,0,0,0,0,0
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS,0,...,0,2,7,0,0,0,0,0,0,0
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP,0,...,1,2,7,0,0,1,0,0,1,0
5,7348,1958,PhD,Single,"$71,691.00",0,0,3/17/14,SP,0,...,7,5,2,0,0,0,0,0,1,0
6,4073,1954,2n Cycle,Married,"$63,564.00",0,0,1/29/14,GER,0,...,10,7,6,0,0,1,0,0,1,0
7,1991,1967,Graduation,Together,"$44,931.00",0,1,1/18/14,SP,0,...,1,3,5,0,0,0,0,0,0,0
8,4047,1954,PhD,Married,"$65,324.00",0,1,1/11/14,US,0,...,2,9,4,0,0,0,0,0,0,0
9,9477,1954,PhD,Married,"$65,324.00",0,1,1/11/14,IND,0,...,2,9,4,0,0,0,0,0,0,0

In [12]:
# Calculating null values
null_count= merged_df.isna().sum()
null_count

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
 Income                24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Country                 0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp1            0
AcceptedCmp2            0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
Response                0
Complain                0
dtype: int64

In [13]:
null_percentage = (merged_df.isnull().mean() * 100).round(2)

In [14]:
# Percentage of null values
null_df = pd.DataFrame({'Column': null_percentage.index, 'Null Percentage': null_percentage.values})
null_df

                 Column  Null Percentage
0                    ID             0.00
1            Year_Birth             0.00
2             Education             0.00
3        Marital_Status             0.00
4               Income              1.07
5               Kidhome             0.00
6              Teenhome             0.00
7           Dt_Customer             0.00
8               Country             0.00
9               Recency             0.00
10             MntWines             0.00
11            MntFruits             0.00
12      MntMeatProducts             0.00
13      MntFishProducts             0.00
14     MntSweetProducts             0.00
15         MntGoldProds             0.00
16    NumDealsPurchases             0.00
17      NumWebPurchases             0.00
18  NumCatalogPurchases             0.00
19    NumStorePurchases             0.00
20    NumWebVisitsMonth             0.00
21         AcceptedCmp1             0.00
22         AcceptedCmp2             0.00
23         AcceptedCmp3             0.00
24         AcceptedCmp4             0.00
25         AcceptedCmp5             0.00
26             Response             0.00
27             Complain             0.00

In [50]:
for col in merged_df.columns:
    unique_values = merged_df[col].unique()
    print(f"Column {col}: Unique values: {unique_values}")

Column ID: Unique values: [ 1826     1 10476 ...    22   528  4070]
Column Year_Birth: Unique values: [1970 1961 1958 1967 1989 1954 1947 1979 1959 1981 1969 1977 1960 1966
 1976 1965 1956 1975 1971 1986 1972 1974 1990 1987 1984 1968 1955 1983
 1973 1978 1952 1962 1964 1982 1963 1957 1980 1945 1949 1948 1953 1946
 1985 1992 1944 1951 1988 1950 1994 1993 1991 1893 1996 1995 1899 1943
 1941 1940 1900]
Column Education: Unique values: ['Graduation' 'PhD' '2n Cycle' 'Master' 'Basic']
Column Marital_Status: Unique values: ['Divorced' 'Single' 'Married' 'Together' 'Widow' 'YOLO' 'Alone' 'Absurd']
Column Income_$: Unique values: [84835. 57091. 67267. ... 46310. 65819. 94871.]
Column Kidhome: Unique values: [0 1 2]
Column Teenhome: Unique values: [0 1 2]
Column Dt_Customer: Unique values: ['2014-06-16T00:00:00.000000000' '2014-06-15T00:00:00.000000000'
 '2014-05-13T00:00:00.000000000' '2014-05-11T00:00:00.000000000'
 '2014-04-08T00:00:00.000000000' '2014-03-17T00:00:00.000000000'
 '2014-01-29T00:00:00.000000000' '2014-01-18T00:00:00.000000000'
 '2014-01-11T00:00:00.000000000' '2013-12-27T00:00:00.000000000'
 '2013-12-09T00:00:00.000000000' '2013-12-07T00:00:00.000000000'
 '2013-10-16T00:00:00.000000000' '2013-10-05T00:00:00.000000000'
 '2013-09-11T00:00:00.000000000' '2013-08-01T00:00:00.000000000'
 '2013-07-23T00:00:00.000000000' '2013-07-01T00:00:00.000000000'
 '2013-05-28T00:00:00.000000000' '2013-03-26T00:00:00.000000000'
 '2013-03-15T00:00:00.000000000' '2013-02-12T00:00:00.000000000'
 '2012-11-23T00:00:00.000000000' '2012-10-13T00:00:00.000000000'
 '2012-09-14T00:00:00.000000000' '2014-06-29T00:00:00.000000000'
 '2014-05-31T00:00:00.000000000' '2014-05-30T00:00:00.000000000'
 '2014-04-27T00:00:00.000000000' '2014-04-11T00:00:00.000000000'
 '2013-10-29T00:00:00.000000000' '2013-10-09T00:00:00.000000000'
 '2013-05-10T00:00:00.000000000' '2013-05-09T00:00:00.000000000'
 '2013-04-25T00:00:00.000000000' '2013-04-20T00:00:00.000000000'
 '2013-03-30T00:00:00.000000000' '2013-03-01T00:00:00.000000000'
 '2013-02-14T00:00:00.000000000' '2013-01-11T00:00:00.000000000'
 '2013-01-03T00:00:00.000000000' '2012-12-19T00:00:00.000000000'
 '2012-12-15T00:00:00.000000000' '2012-12-02T00:00:00.000000000'
 '2012-09-17T00:00:00.000000000' '2012-09-11T00:00:00.000000000'
 '2014-05-12T00:00:00.000000000' '2014-04-28T00:00:00.000000000'
 '2014-03-29T00:00:00.000000000' '2014-03-06T00:00:00.000000000'
 '2014-03-04T00:00:00.000000000' '2014-02-04T00:00:00.000000000'
 '2014-02-03T00:00:00.000000000' '2014-01-01T00:00:00.000000000'
 '2013-12-12T00:00:00.000000000' '2013-11-15T00:00:00.000000000'
 '2013-09-20T00:00:00.000000000' '2013-09-05T00:00:00.000000000'
 '2013-08-31T00:00:00.000000000' '2013-07-30T00:00:00.000000000'
 '2013-07-27T00:00:00.000000000' '2013-06-22T00:00:00.000000000'
 '2013-01-05T00:00:00.000000000' '2012-11-21T00:00:00.000000000'
 '2012-11-11T00:00:00.000000000' '2012-09-28T00:00:00.000000000'
 '2012-09-27T00:00:00.000000000' '2012-09-07T00:00:00.000000000'
 '2012-08-13T00:00:00.000000000' '2012-08-11T00:00:00.000000000'
 '2012-08-02T00:00:00.000000000' '2014-06-25T00:00:00.000000000'
 '2014-05-28T00:00:00.000000000' '2014-04-14T00:00:00.000000000'
 '2014-03-10T00:00:00.000000000' '2014-02-27T00:00:00.000000000'
 '2014-02-07T00:00:00.000000000' '2014-01-28T00:00:00.000000000'
 '2013-11-17T00:00:00.000000000' '2013-11-07T00:00:00.000000000'
 '2013-10-17T00:00:00.000000000' '2013-10-13T00:00:00.000000000'
 '2013-10-12T00:00:00.000000000' '2013-09-30T00:00:00.000000000'
 '2013-07-03T00:00:00.000000000' '2013-06-10T00:00:00.000000000'
 '2013-05-29T00:00:00.000000000' '2013-04-29T00:00:00.000000000'
 '2013-03-10T00:00:00.000000000' '2013-01-02T00:00:00.000000000'
 '2012-11-02T00:00:00.000000000' '2012-10-18T00:00:00.000000000'
 '2012-10-01T00:00:00.000000000' '2012-09-03T00:00:00.000000000'
 '2012-08-26T00:00:00.000000000' '2014-05-23T00:00:00.000000000'
 '2014-05-17T00:00:00.000000000' '2014-04-21T00:00:00.000000000'
 '2014-03-23T00:00:00.000000000' '2013-12-16T00:00:00.000000000'
 '2013-11-26T00:00:00.000000000' '2013-11-14T00:00:00.000000000'
 '2013-11-06T00:00:00.000000000' '2013-10-06T00:00:00.000000000'
 '2013-09-27T00:00:00.000000000' '2013-09-18T00:00:00.000000000'
 '2013-09-09T00:00:00.000000000' '2013-07-18T00:00:00.000000000'
 '2013-07-08T00:00:00.000000000' '2013-05-27T00:00:00.000000000'
 '2013-03-05T00:00:00.000000000' '2013-02-20T00:00:00.000000000'
 '2013-01-12T00:00:00.000000000' '2012-12-24T00:00:00.000000000'
 '2012-11-19T00:00:00.000000000' '2014-03-28T00:00:00.000000000'
 '2014-02-24T00:00:00.000000000' '2013-09-02T00:00:00.000000000'
 '2013-08-20T00:00:00.000000000' '2013-06-23T00:00:00.000000000'
 '2013-05-05T00:00:00.000000000' '2013-04-05T00:00:00.000000000'
 '2013-01-04T00:00:00.000000000' '2012-12-27T00:00:00.000000000'
 '2012-11-10T00:00:00.000000000' '2012-10-29T00:00:00.000000000'
 '2012-09-22T00:00:00.000000000' '2014-03-31T00:00:00.000000000'
 '2014-03-21T00:00:00.000000000' '2014-02-09T00:00:00.000000000'
 '2013-09-23T00:00:00.000000000' '2013-06-27T00:00:00.000000000'
 '2013-03-28T00:00:00.000000000' '2013-03-12T00:00:00.000000000'
 '2013-01-16T00:00:00.000000000' '2013-01-08T00:00:00.000000000'
 '2012-12-29T00:00:00.000000000' '2012-12-12T00:00:00.000000000'
 '2012-11-25T00:00:00.000000000' '2012-09-21T00:00:00.000000000'
 '2012-09-09T00:00:00.000000000' '2012-09-05T00:00:00.000000000'
 '2012-08-17T00:00:00.000000000' '2014-06-22T00:00:00.000000000'
 '2014-05-01T00:00:00.000000000' '2014-01-03T00:00:00.000000000'
 '2013-10-11T00:00:00.000000000' '2013-08-13T00:00:00.000000000'
 '2013-06-09T00:00:00.000000000' '2013-05-07T00:00:00.000000000'
 '2012-10-02T00:00:00.000000000' '2012-09-12T00:00:00.000000000'
 '2014-03-19T00:00:00.000000000' '2014-03-03T00:00:00.000000000'
 '2014-02-22T00:00:00.000000000' '2014-01-24T00:00:00.000000000'
 '2013-12-04T00:00:00.000000000' '2013-11-28T00:00:00.000000000'
 '2013-11-05T00:00:00.000000000' '2013-10-03T00:00:00.000000000'
 '2013-08-09T00:00:00.000000000' '2013-08-07T00:00:00.000000000'
 '2013-07-17T00:00:00.000000000' '2013-07-09T00:00:00.000000000'
 '2013-06-11T00:00:00.000000000' '2013-05-17T00:00:00.000000000'
 '2013-03-23T00:00:00.000000000' '2013-02-19T00:00:00.000000000'
 '2013-01-19T00:00:00.000000000' '2013-01-10T00:00:00.000000000'
 '2013-01-01T00:00:00.000000000' '2012-11-12T00:00:00.000000000'
 '2014-05-18T00:00:00.000000000' '2014-03-30T00:00:00.000000000'
 '2014-01-30T00:00:00.000000000' '2014-01-26T00:00:00.000000000'
 '2014-01-22T00:00:00.000000000' '2014-01-15T00:00:00.000000000'
 '2013-12-13T00:00:00.000000000' '2013-08-04T00:00:00.000000000'
 '2013-05-01T00:00:00.000000000' '2013-04-24T00:00:00.000000000'
 '2013-04-03T00:00:00.000000000' '2013-02-03T00:00:00.000000000'
 '2012-11-16T00:00:00.000000000' '2012-08-03T00:00:00.000000000'
 '2014-04-18T00:00:00.000000000' '2014-04-01T00:00:00.000000000'
 '2014-03-18T00:00:00.000000000' '2014-02-10T00:00:00.000000000'
 '2013-11-23T00:00:00.000000000' '2013-11-21T00:00:00.000000000'
 '2013-10-02T00:00:00.000000000' '2013-07-21T00:00:00.000000000'
 '2013-06-18T00:00:00.000000000' '2013-03-24T00:00:00.000000000'
 '2012-12-06T00:00:00.000000000' '2012-11-09T00:00:00.000000000'
 '2014-02-14T00:00:00.000000000' '2013-10-22T00:00:00.000000000'
 '2013-10-04T00:00:00.000000000' '2013-09-21T00:00:00.000000000'
 '2013-08-05T00:00:00.000000000' '2013-07-14T00:00:00.000000000'
 '2013-07-04T00:00:00.000000000' '2013-04-12T00:00:00.000000000'
 '2013-04-10T00:00:00.000000000' '2013-04-08T00:00:00.000000000'
 '2013-03-31T00:00:00.000000000' '2013-03-17T00:00:00.000000000'
 '2013-01-21T00:00:00.000000000' '2012-12-10T00:00:00.000000000'
 '2012-09-24T00:00:00.000000000' '2012-08-06T00:00:00.000000000'
 '2014-06-18T00:00:00.000000000' '2014-04-05T00:00:00.000000000'
 '2013-12-21T00:00:00.000000000' '2013-10-27T00:00:00.000000000'
 '2013-10-21T00:00:00.000000000' '2013-09-19T00:00:00.000000000'
 '2013-09-04T00:00:00.000000000' '2013-06-25T00:00:00.000000000'
 '2013-04-27T00:00:00.000000000' '2013-04-18T00:00:00.000000000'
 '2012-12-30T00:00:00.000000000' '2012-08-22T00:00:00.000000000'
 '2012-08-08T00:00:00.000000000' '2014-06-19T00:00:00.000000000'
 '2014-04-20T00:00:00.000000000' '2014-02-28T00:00:00.000000000'
 '2013-12-17T00:00:00.000000000' '2013-11-25T00:00:00.000000000'
 '2013-10-28T00:00:00.000000000' '2013-08-15T00:00:00.000000000'
 '2013-07-05T00:00:00.000000000' '2013-06-19T00:00:00.000000000'
 '2013-06-16T00:00:00.000000000' '2013-04-22T00:00:00.000000000'
 '2013-03-19T00:00:00.000000000' '2013-02-23T00:00:00.000000000'
 '2013-02-15T00:00:00.000000000' '2012-10-31T00:00:00.000000000'
 '2012-10-07T00:00:00.000000000' '2012-08-09T00:00:00.000000000'
 '2014-05-06T00:00:00.000000000' '2014-04-15T00:00:00.000000000'
 '2014-03-05T00:00:00.000000000' '2014-02-19T00:00:00.000000000'
 '2013-09-07T00:00:00.000000000' '2013-08-06T00:00:00.000000000'
 '2013-07-25T00:00:00.000000000' '2013-04-30T00:00:00.000000000'
 '2012-09-10T00:00:00.000000000' '2014-03-20T00:00:00.000000000'
 '2013-09-28T00:00:00.000000000' '2013-09-24T00:00:00.000000000'
 '2013-02-16T00:00:00.000000000' '2012-11-22T00:00:00.000000000'
 '2012-09-18T00:00:00.000000000' '2012-08-16T00:00:00.000000000'
 '2014-06-05T00:00:00.000000000' '2014-04-13T00:00:00.000000000'
 '2014-04-10T00:00:00.000000000' '2014-04-03T00:00:00.000000000'
 '2014-02-12T00:00:00.000000000' '2013-12-15T00:00:00.000000000'
 '2013-10-30T00:00:00.000000000' '2013-08-26T00:00:00.000000000'
 '2013-02-02T00:00:00.000000000' '2013-01-25T00:00:00.000000000'
 '2012-11-17T00:00:00.000000000' '2012-11-13T00:00:00.000000000'
 '2012-11-07T00:00:00.000000000' '2012-11-01T00:00:00.000000000'
 '2012-10-16T00:00:00.000000000' '2014-05-08T00:00:00.000000000'
 '2014-03-02T00:00:00.000000000' '2013-06-24T00:00:00.000000000'
 '2013-06-13T00:00:00.000000000' '2013-04-23T00:00:00.000000000'
 '2013-04-15T00:00:00.000000000' '2013-01-29T00:00:00.000000000'
 '2012-10-30T00:00:00.000000000' '2012-10-23T00:00:00.000000000'
 '2014-04-17T00:00:00.000000000' '2014-02-25T00:00:00.000000000'
 '2013-12-11T00:00:00.000000000' '2013-10-10T00:00:00.000000000'
 '2013-05-20T00:00:00.000000000' '2013-05-18T00:00:00.000000000'
 '2013-04-07T00:00:00.000000000' '2013-03-03T00:00:00.000000000'
 '2012-12-07T00:00:00.000000000' '2012-11-28T00:00:00.000000000'
 '2012-10-27T00:00:00.000000000' '2012-09-15T00:00:00.000000000'
 '2014-06-17T00:00:00.000000000' '2014-05-29T00:00:00.000000000'
 '2014-03-01T00:00:00.000000000' '2014-02-15T00:00:00.000000000'
 '2013-12-23T00:00:00.000000000' '2013-11-29T00:00:00.000000000'
 '2013-10-25T00:00:00.000000000' '2013-08-17T00:00:00.000000000'
 '2013-06-06T00:00:00.000000000' '2013-03-29T00:00:00.000000000'
 '2012-09-23T00:00:00.000000000' '2012-08-30T00:00:00.000000000'
 '2012-08-01T00:00:00.000000000' '2014-02-08T00:00:00.000000000'
 '2014-01-25T00:00:00.000000000' '2013-11-27T00:00:00.000000000'
 '2013-10-19T00:00:00.000000000' '2013-03-07T00:00:00.000000000'
 '2013-02-28T00:00:00.000000000' '2013-01-17T00:00:00.000000000'
 '2012-11-20T00:00:00.000000000' '2012-11-05T00:00:00.000000000'
 '2012-11-03T00:00:00.000000000' '2012-08-31T00:00:00.000000000'
 '2012-08-12T00:00:00.000000000' '2014-05-15T00:00:00.000000000'
 '2014-04-12T00:00:00.000000000' '2014-04-06T00:00:00.000000000'
 '2014-02-06T00:00:00.000000000' '2013-07-29T00:00:00.000000000'
 '2013-06-29T00:00:00.000000000' '2013-06-17T00:00:00.000000000'
 '2013-06-08T00:00:00.000000000' '2013-05-26T00:00:00.000000000'
 '2012-11-08T00:00:00.000000000' '2012-08-04T00:00:00.000000000'
 '2014-04-30T00:00:00.000000000' '2014-04-07T00:00:00.000000000'
 '2014-03-12T00:00:00.000000000' '2013-04-13T00:00:00.000000000'
 '2013-02-13T00:00:00.000000000' '2014-06-03T00:00:00.000000000'
 '2014-03-25T00:00:00.000000000' '2014-02-17T00:00:00.000000000'
 '2014-02-05T00:00:00.000000000' '2014-01-27T00:00:00.000000000'
 '2014-01-14T00:00:00.000000000' '2013-07-11T00:00:00.000000000'
 '2013-06-02T00:00:00.000000000' '2013-06-01T00:00:00.000000000'
 '2013-05-04T00:00:00.000000000' '2013-03-18T00:00:00.000000000'
 '2012-12-03T00:00:00.000000000' '2012-11-24T00:00:00.000000000'
 '2012-10-26T00:00:00.000000000' '2014-06-20T00:00:00.000000000'
 '2014-01-19T00:00:00.000000000' '2014-01-09T00:00:00.000000000'
 '2013-12-29T00:00:00.000000000' '2013-12-26T00:00:00.000000000'
 '2013-12-08T00:00:00.000000000' '2013-11-20T00:00:00.000000000'
 '2013-08-23T00:00:00.000000000' '2013-08-19T00:00:00.000000000'
 '2013-07-24T00:00:00.000000000' '2012-10-06T00:00:00.000000000'
 '2012-08-18T00:00:00.000000000' '2014-05-07T00:00:00.000000000'
 '2013-11-09T00:00:00.000000000' '2013-08-25T00:00:00.000000000'
 '2013-05-16T00:00:00.000000000' '2013-04-01T00:00:00.000000000'
 '2013-03-27T00:00:00.000000000' '2013-02-08T00:00:00.000000000'
 '2012-09-20T00:00:00.000000000' '2014-05-22T00:00:00.000000000'
 '2013-12-30T00:00:00.000000000' '2013-11-02T00:00:00.000000000'
 '2013-08-21T00:00:00.000000000' '2013-07-12T00:00:00.000000000'
 '2013-06-28T00:00:00.000000000' '2013-06-04T00:00:00.000000000'
 '2013-05-31T00:00:00.000000000' '2013-03-06T00:00:00.000000000'
 '2013-02-18T00:00:00.000000000' '2012-09-26T00:00:00.000000000'
 '2012-08-19T00:00:00.000000000' '2014-05-02T00:00:00.000000000'
 '2014-04-29T00:00:00.000000000' '2014-02-02T00:00:00.000000000'
 '2014-01-05T00:00:00.000000000' '2013-12-05T00:00:00.000000000'
 '2013-11-18T00:00:00.000000000' '2013-09-10T00:00:00.000000000'
 '2013-08-03T00:00:00.000000000' '2013-02-21T00:00:00.000000000'
 '2013-02-10T00:00:00.000000000' '2013-01-31T00:00:00.000000000'
 '2012-12-09T00:00:00.000000000' '2012-09-29T00:00:00.000000000'
 '2014-06-09T00:00:00.000000000' '2014-04-02T00:00:00.000000000'
 '2014-03-24T00:00:00.000000000' '2014-01-23T00:00:00.000000000'
 '2013-09-16T00:00:00.000000000' '2013-09-12T00:00:00.000000000'
 '2013-07-15T00:00:00.000000000' '2013-03-09T00:00:00.000000000'
 '2013-02-09T00:00:00.000000000' '2012-12-14T00:00:00.000000000'
 '2012-10-17T00:00:00.000000000' '2014-06-23T00:00:00.000000000'
 '2014-06-12T00:00:00.000000000' '2014-06-07T00:00:00.000000000'
 '2014-04-09T00:00:00.000000000' '2014-02-13T00:00:00.000000000'
 '2013-12-06T00:00:00.000000000' '2013-10-20T00:00:00.000000000'
 '2013-06-20T00:00:00.000000000' '2013-05-08T00:00:00.000000000'
 '2013-03-11T00:00:00.000000000' '2012-09-06T00:00:00.000000000'
 '2014-03-09T00:00:00.000000000' '2014-02-11T00:00:00.000000000'
 '2013-10-08T00:00:00.000000000' '2013-08-28T00:00:00.000000000'
 '2013-07-06T00:00:00.000000000' '2013-05-30T00:00:00.000000000'
 '2013-05-22T00:00:00.000000000' '2013-04-02T00:00:00.000000000'
 '2013-03-20T00:00:00.000000000' '2013-03-14T00:00:00.000000000'
 '2013-01-22T00:00:00.000000000' '2012-09-08T00:00:00.000000000'
 '2012-08-25T00:00:00.000000000' '2012-08-14T00:00:00.000000000'
 '2013-11-19T00:00:00.000000000' '2013-06-03T00:00:00.000000000'
 '2012-12-21T00:00:00.000000000' '2012-10-10T00:00:00.000000000'
 '2012-08-07T00:00:00.000000000' '2013-12-24T00:00:00.000000000'
 '2013-12-14T00:00:00.000000000' '2013-05-15T00:00:00.000000000'
 '2013-05-06T00:00:00.000000000' '2013-01-07T00:00:00.000000000'
 '2012-11-29T00:00:00.000000000' '2014-04-24T00:00:00.000000000'
 '2014-03-08T00:00:00.000000000' '2013-07-16T00:00:00.000000000'
 '2013-02-22T00:00:00.000000000' '2013-01-20T00:00:00.000000000'
 '2013-01-13T00:00:00.000000000' '2012-12-25T00:00:00.000000000'
 '2012-12-11T00:00:00.000000000' '2014-06-27T00:00:00.000000000'
 '2014-03-16T00:00:00.000000000' '2013-11-03T00:00:00.000000000'
 '2013-09-25T00:00:00.000000000' '2013-09-15T00:00:00.000000000'
 '2013-09-01T00:00:00.000000000' '2013-08-02T00:00:00.000000000'
 '2012-08-27T00:00:00.000000000' '2014-04-04T00:00:00.000000000'
 '2013-09-22T00:00:00.000000000' '2012-12-22T00:00:00.000000000'
 '2012-12-16T00:00:00.000000000' '2012-08-20T00:00:00.000000000'
 '2014-01-07T00:00:00.000000000' '2013-12-01T00:00:00.000000000'
 '2013-09-26T00:00:00.000000000' '2013-02-25T00:00:00.000000000'
 '2012-10-24T00:00:00.000000000' '2012-10-22T00:00:00.000000000'
 '2012-07-31T00:00:00.000000000' '2014-05-19T00:00:00.000000000'
 '2014-05-03T00:00:00.000000000' '2014-04-16T00:00:00.000000000'
 '2013-12-31T00:00:00.000000000' '2013-12-02T00:00:00.000000000'
 '2013-07-22T00:00:00.000000000' '2013-04-21T00:00:00.000000000'
 '2013-04-11T00:00:00.000000000' '2014-03-22T00:00:00.000000000'
 '2013-02-06T00:00:00.000000000' '2012-12-04T00:00:00.000000000'
 '2012-11-06T00:00:00.000000000' '2012-08-28T00:00:00.000000000'
 '2013-07-02T00:00:00.000000000' '2012-10-12T00:00:00.000000000'
 '2014-05-16T00:00:00.000000000' '2014-04-25T00:00:00.000000000'
 '2013-11-13T00:00:00.000000000' '2013-09-06T00:00:00.000000000'
 '2012-11-18T00:00:00.000000000' '2012-10-15T00:00:00.000000000'
 '2014-06-14T00:00:00.000000000' '2014-01-17T00:00:00.000000000'
 '2013-02-07T00:00:00.000000000' '2013-12-20T00:00:00.000000000'
 '2013-09-13T00:00:00.000000000' '2013-01-06T00:00:00.000000000'
 '2014-05-26T00:00:00.000000000' '2014-01-13T00:00:00.000000000'
 '2013-08-08T00:00:00.000000000' '2013-04-06T00:00:00.000000000'
 '2014-02-26T00:00:00.000000000' '2013-05-14T00:00:00.000000000'
 '2012-08-24T00:00:00.000000000' '2014-05-27T00:00:00.000000000'
 '2014-02-23T00:00:00.000000000' '2014-01-10T00:00:00.000000000'
 '2013-07-19T00:00:00.000000000' '2013-03-25T00:00:00.000000000'
 '2013-02-11T00:00:00.000000000' '2013-01-15T00:00:00.000000000'
 '2012-12-05T00:00:00.000000000' '2014-06-13T00:00:00.000000000'
 '2014-06-02T00:00:00.000000000' '2013-11-01T00:00:00.000000000'
 '2013-08-16T00:00:00.000000000' '2013-02-17T00:00:00.000000000'
 '2013-02-04T00:00:00.000000000' '2012-10-19T00:00:00.000000000'
 '2014-06-26T00:00:00.000000000' '2013-10-23T00:00:00.000000000'
 '2013-04-14T00:00:00.000000000' '2012-10-28T00:00:00.000000000'
 '2013-10-01T00:00:00.000000000' '2013-03-08T00:00:00.000000000'
 '2012-11-14T00:00:00.000000000' '2014-01-12T00:00:00.000000000'
 '2013-11-04T00:00:00.000000000' '2013-08-22T00:00:00.000000000'
 '2013-06-21T00:00:00.000000000' '2013-01-23T00:00:00.000000000'
 '2012-10-21T00:00:00.000000000' '2012-10-04T00:00:00.000000000'
 '2014-01-31T00:00:00.000000000' '2014-01-21T00:00:00.000000000'
 '2013-12-28T00:00:00.000000000' '2013-08-11T00:00:00.000000000'
 '2013-05-13T00:00:00.000000000' '2012-09-02T00:00:00.000000000'
 '2014-06-24T00:00:00.000000000' '2014-06-08T00:00:00.000000000'
 '2014-05-24T00:00:00.000000000' '2013-10-18T00:00:00.000000000'
 '2013-09-17T00:00:00.000000000' '2013-08-14T00:00:00.000000000'
 '2013-07-20T00:00:00.000000000' '2013-06-30T00:00:00.000000000'
 '2013-05-11T00:00:00.000000000' '2013-04-16T00:00:00.000000000'
 '2014-05-25T00:00:00.000000000' '2014-05-10T00:00:00.000000000'
 '2014-05-04T00:00:00.000000000' '2013-08-29T00:00:00.000000000'
 '2013-03-22T00:00:00.000000000' '2014-06-04T00:00:00.000000000'
 '2013-05-23T00:00:00.000000000' '2013-02-01T00:00:00.000000000'
 '2014-02-16T00:00:00.000000000' '2013-10-24T00:00:00.000000000'
 '2013-03-02T00:00:00.000000000' '2012-12-18T00:00:00.000000000'
 '2012-11-04T00:00:00.000000000' '2014-06-11T00:00:00.000000000'
 '2013-06-14T00:00:00.000000000' '2014-06-10T00:00:00.000000000'
 '2014-05-05T00:00:00.000000000' '2014-04-19T00:00:00.000000000'
 '2013-08-18T00:00:00.000000000' '2013-02-26T00:00:00.000000000'
 '2013-08-30T00:00:00.000000000' '2013-06-12T00:00:00.000000000'
 '2013-05-12T00:00:00.000000000' '2012-10-09T00:00:00.000000000'
 '2013-11-10T00:00:00.000000000' '2013-08-24T00:00:00.000000000'
 '2012-09-04T00:00:00.000000000' '2013-02-27T00:00:00.000000000'
 '2014-01-06T00:00:00.000000000' '2013-07-07T00:00:00.000000000'
 '2012-11-26T00:00:00.000000000' '2012-08-29T00:00:00.000000000'
 '2013-05-02T00:00:00.000000000' '2013-03-04T00:00:00.000000000'
 '2013-01-27T00:00:00.000000000' '2012-08-23T00:00:00.000000000'
 '2013-10-14T00:00:00.000000000' '2012-12-23T00:00:00.000000000'
 '2012-12-01T00:00:00.000000000' '2012-08-05T00:00:00.000000000'

In [16]:
zero_count = (merged_df == 0).sum()
zero_count

ID                        1
Year_Birth                0
Education                 0
Marital_Status            0
 Income                   0
Kidhome                1293
Teenhome               1158
Dt_Customer               0
Country                   0
Recency                  28
MntWines                 13
MntFruits               400
MntMeatProducts           1
MntFishProducts         384
MntSweetProducts        419
MntGoldProds             61
NumDealsPurchases        46
NumWebPurchases          49
NumCatalogPurchases     586
NumStorePurchases        15
NumWebVisitsMonth        11
AcceptedCmp1           2096
AcceptedCmp2           2210
AcceptedCmp3           2077
AcceptedCmp4           2073
AcceptedCmp5           2077
Response               1906
Complain               2219
dtype: int64

In [18]:
# Percentage of zero values
zero_percentage = ((merged_df == 0).mean() * 100).round(2)
zero_percentage

ID                      0.04
Year_Birth              0.00
Education               0.00
Marital_Status          0.00
 Income                 0.00
Kidhome                57.72
Teenhome               51.70
Dt_Customer             0.00
Country                 0.00
Recency                 1.25
MntWines                0.58
MntFruits              17.86
MntMeatProducts         0.04
MntFishProducts        17.14
MntSweetProducts       18.71
MntGoldProds            2.72
NumDealsPurchases       2.05
NumWebPurchases         2.19
NumCatalogPurchases    26.16
NumStorePurchases       0.67
NumWebVisitsMonth       0.49
AcceptedCmp1           93.57
AcceptedCmp2           98.66
AcceptedCmp3           92.72
AcceptedCmp4           92.54
AcceptedCmp5           92.72
Response               85.09
Complain               99.06
dtype: float64

In [36]:
zero_df = pd.DataFrame({'Column': zero_percentage.index, 'Zero Percentage': zero_percentage.values})
zero_df

                 Column  Zero Percentage
0                    ID             0.04
1            Year_Birth             0.00
2             Education             0.00
3        Marital_Status             0.00
4               Income              0.00
5               Kidhome            57.72
6              Teenhome            51.70
7           Dt_Customer             0.00
8               Country             0.00
9               Recency             1.25
10             MntWines             0.58
11            MntFruits            17.86
12      MntMeatProducts             0.04
13      MntFishProducts            17.14
14     MntSweetProducts            18.71
15         MntGoldProds             2.72
16    NumDealsPurchases             2.05
17      NumWebPurchases             2.19
18  NumCatalogPurchases            26.16
19    NumStorePurchases             0.67
20    NumWebVisitsMonth             0.49
21         AcceptedCmp1            93.57
22         AcceptedCmp2            98.66
23         AcceptedCmp3            92.72
24         AcceptedCmp4            92.54
25         AcceptedCmp5            92.72
26             Response            85.09
27             Complain            99.06

In [19]:
merged_df['Dt_Customer'] = pd.to_datetime(merged_df['Dt_Customer'])

In [20]:
merged_df = merged_df.rename(columns={' Income ': 'Income_$'})

In [21]:
merged_df['Income_$'] = merged_df['Income_$'].fillna(0).replace('[$,.]', '', regex=True).replace(' ', '').replace('.00', '').replace(',', '').astype(int)

In [23]:
merged_df['Income_$'] = merged_df['Income_$']/100

In [25]:
merged_df['Income_$'] = merged_df['Income_$'].astype(int)

In [26]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income_$             2240 non-null   int32
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   datetime64[ns]
 8   Country              2240 non-null   object
 9   Recency              2240 non-null   int64
 10  MntWines             2240 non-null   int64
 11  MntFruits            2240 non-null   int64
 12  MntMeatProducts      2240 non-null   int64
 13  MntFishProducts      2240 non-null   int64
 14  MntSweetProducts     2240 non-null   int64
 15  MntGoldProds         2240 non-null   int64
 16  NumDealsPurchases    2240 non-null   int64
 17  NumWebPurchases      2240 non-null   int64
 18  NumCatalogPurchases  2240 non-null   int64
 19  NumStorePurchases    2240 non-null   int64
 20  NumWebVisitsMonth    2240 non-null   int64
 21  AcceptedCmp1         2240 non-null   int64
 22  AcceptedCmp2         2240 non-null   int64
 23  AcceptedCmp3         2240 non-null   int64
 24  AcceptedCmp4         2240 non-null   int64
 25  AcceptedCmp5         2240 non-null   int64
 26  Response             2240 non-null   int64
 27  Complain             2240 non-null   int64
dtypes: datetime64[ns](1), int32(1), int64(23), object(3)
memory usage: 498.8+ KB

In [27]:
merged_df.head()

,ID,Year_Birth,Education,Marital_Status,Income_$,Kidhome,Teenhome,Dt_Customer,Country,Recency,...,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,1970,Graduation,Divorced,84835,0,0,2014-06-16,SP,0,...,4,6,1,0,0,0,0,0,1,0
1,1,1961,Graduation,Single,57091,0,0,2014-06-15,CA,0,...,3,7,5,0,1,0,0,0,1,0
2,10476,1958,Graduation,Married,67267,0,1,2014-05-13,US,0,...,2,5,2,0,0,0,0,0,0,0
3,1386,1967,Graduation,Together,32474,1,1,2014-05-11,AUS,0,...,0,2,7,0,0,0,0,0,0,0
4,5371,1989,Graduation,Single,21474,1,0,2014-04-08,SP,0,...,1,2,7,0,0,1,0,0,1,0

In [28]:
merged_df['Income_$'].mean()

51687.459375

In [29]:
merged_df['Income_$'].median()

51075.0

In [39]:
merged_df['Income_$'].max()

666666.0

In [30]:
import numpy as np

# Assuming merged_df is your DataFrame containing the 'Income_$' column

# Interquartile Range (IQR) Method
Q1 = merged_df['Income_$'].quantile(0.25)
Q3 = merged_df['Income_$'].quantile(0.75)
IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

outliers_iqr = merged_df[(merged_df['Income_$'] < lower_bound) | (merged_df['Income_$'] > upper_bound)]
print("Outliers using IQR method:")
outliers_iqr["Income_$"]

Outliers using IQR method:

325     157146
497     160803
527     666666
731     162397
853     157733
1826    153924
1925    156924
2204    157243
Name: Income_$, dtype: int32

In [31]:
# Z-score Method
mean_income = merged_df['Income_$'].mean()
std_dev_income = merged_df['Income_$'].std()

threshold = 3  # Adjust this threshold as needed (common values are 2 or 3)
outliers_zscore = merged_df[np.abs((merged_df['Income_$'] - mean_income) / std_dev_income) > threshold]
print("\nOutliers using Z-score method:")
outliers_zscore['Income_$']

Outliers using Z-score method:

325     157146
497     160803
527     666666
731     162397
853     157733
1826    153924
1925    156924
2204    157243
Name: Income_$, dtype: int32

In [32]:
# Calculate mean or median of non-outlier values
non_outlier_values = merged_df[~merged_df.index.isin(outliers_iqr.index)]['Income_$']
imputation_value = non_outlier_values.mean()

# Impute zero values
merged_df.loc[merged_df['Income_$'] == 0, 'Income_$'] = imputation_value

In [38]:
# Identify numeric columns
numeric_columns = merged_df.select_dtypes(include=np.number).columns

# Identify categorical columns (assuming they are of object type)
categorical_columns = merged_df.select_dtypes(include='object').columns

# Exclude 'year', 'id', and categorical columns
columns_of_interest = [col for col in numeric_columns if col not in ['Year_Birth', 'ID']] 

# Calculate univariate statistics for selected columns
univariate_stats = merged_df[columns_of_interest].describe(percentiles=[0.25, 0.5, 0.75, 0.90, 0.95])

# Add min and max to the DataFrame
univariate_stats.loc['min'] = merged_df[columns_of_interest].min()
univariate_stats.loc['max'] = merged_df[columns_of_interest].max()

# Display the univariate statistics
univariate_stats

,Income_$,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,...,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
count,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,...,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000
mean,52234.728351,0.444196,0.506250,49.109375,303.935714,26.302232,166.950000,37.525446,27.062946,44.021875,...,2.662054,5.790179,5.316518,0.064286,0.013393,0.072768,0.074554,0.072768,0.149107,0.009375
std,25038.086463,0.538398,0.544538,28.962453,336.597393,39.773434,225.715373,54.628979,41.280498,52.167439,...,2.923101,3.250958,2.426645,0.245316,0.114976,0.259813,0.262728,0.259813,0.356274,0.096391
min,1730.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,35538.750000,0.000000,0.000000,24.000000,23.750000,1.000000,16.000000,3.000000,1.000000,9.000000,...,0.000000,3.000000,3.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,51094.718862,0.000000,0.000000,49.000000,173.500000,8.000000,67.000000,12.000000,8.000000,24.000000,...,2.000000,5.000000,6.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,68289.750000,1.000000,1.000000,74.000000,504.250000,33.000000,232.000000,50.000000,33.000000,56.000000,...,4.000000,8.000000,7.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
90%,79800.300000,1.000000,1.000000,89.000000,822.100000,83.000000,499.000000,120.000000,89.000000,122.000000,...,7.000000,11.000000,8.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000
95%,83927.000000,1.000000,1.000000,94.000000,1000.000000,123.000000,687.100000,168.050000,126.000000,165.050000,...,9.000000,12.000000,8.000000,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,0.000000
max,666666.000000,2.000000,2.000000,99.000000,1493.000000,199.000000,1725.000000,259.000000,263.000000,362.000000,...,28.000000,13.000000,20.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [42]:
# Calculate percentage of missing values and number of unique values for each categorical column
categorical_stats = pd.DataFrame(columns=['Missing%', 'Unique'])

for column in merged_df.select_dtypes(include='object').columns:
    missing_percentage = (merged_df[column].isna().sum() / len(merged_df)) * 100
    unique_values = merged_df[column].nunique()
    categorical_stats.loc[column] = [missing_percentage, unique_values]

# Display the categorical statistics
categorical_stats

                Missing%  Unique
Education            0.0     5.0
Marital_Status       0.0     8.0
Country              0.0     8.0

In [43]:
merged_df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income_$',
       'Kidhome', 'Teenhome', 'Dt_Customer', 'Country', 'Recency', 'MntWines',
       'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp1', 'AcceptedCmp2', 'AcceptedCmp3', 'AcceptedCmp4',
       'AcceptedCmp5', 'Response', 'Complain'],
      dtype='object')

In [46]:
import pandas as pd

# Define a function to detect outliers using the IQR method
def detect_outliers_iqr(data):
    Q1 = data.quantile(0.25)
    Q3 = data.quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    outliers = data[(data < lower_bound) | (data > upper_bound)]
    return outliers

# List of columns to check for outliers
columns_to_check = ['Income_$', 'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds']

# Initialize an empty list to store outlier DataFrames
outliers_dfs = []

# Identify outliers for each column and store in a list
for column in columns_to_check:
    outliers = detect_outliers_iqr(merged_df[column])
    outliers_df = pd.DataFrame({'Column': column, 'Outliers': outliers})
    outliers_dfs.append(outliers_df)

# Concatenate all outlier DataFrames into a single DataFrame
outliers_df = pd.concat(outliers_dfs, ignore_index=True)

# Display the DataFrame containing outliers
outliers_df

            Column  Outliers
0         Income_$  157146.0
1         Income_$  160803.0
2         Income_$  666666.0
3         Income_$  162397.0
4         Income_$  157733.0
...            ...       ...
1118  MntGoldProds     191.0
1119  MntGoldProds     139.0
1120  MntGoldProds     187.0
1121  MntGoldProds     183.0
1122  MntGoldProds     144.0

[1123 rows x 2 columns]

In [48]:
import pandas as pd

# Define a function to detect outliers using the IQR method
def detect_outliers_iqr(data):
    Q1 = data.quantile(0.25)
    Q3 = data.quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    outliers_count = ((data < lower_bound) | (data > upper_bound)).sum()
    return outliers_count

# List of columns to check for outliers
columns_to_check = ['Income_$', 'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds']

# Initialize an empty list to store outlier DataFrames
outliers_dfs = []

# Calculate outliers count for each column and store in a list
for column in columns_to_check:
    outliers_count = detect_outliers_iqr(merged_df[column])
    outliers_df = pd.DataFrame({'Column': [column], 'Outliers Count': [outliers_count]})
    outliers_dfs.append(outliers_df)

# Concatenate all outlier DataFrames into a single DataFrame
outliers_count_df = pd.concat(outliers_dfs, ignore_index=True)

# Display the DataFrame containing outliers count
outliers_count_df

             Column  Outliers Count
0          Income_$               8
1           Recency               0
2          MntWines              35
3         MntFruits             227
4   MntMeatProducts             175
5   MntFishProducts             223
6  MntSweetProducts             248
7      MntGoldProds             207